app/controllers/cards_controller.rb

INSERT INTO "cards" ("credit_card_number", "cardholder_Name", "card_expiration_date", "card_security_code", "number_shares", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @card = Card.new(card_params)

    if @card.save