app/controllers/insurances_controller.rb

  def index
    @insurances = Insurance.all
---
SELECT "insurances".* FROM "insurances"