app/controllers/tariffs_controller.rb

SELECT "tariffs".* FROM "tariffs"
---
  def index
    @tariffs = Tariff.all

INSERT INTO "tariffs" ("code", "year", "vehicle_class", "subtype", "age", "commercial_rate", "premium_value", "fosyga_contribution", "subtotal_premium_and_contribution", "runt_rate", "total_to_pay", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @tariff = Tariff.new(tariff_params)

    if @tariff.save