app/controllers/vehicles_controller.rb

  def index
    @vehicles = Vehicle.all
---
SELECT "vehicles".* FROM "vehicles"

  def create
    @vehicle = Vehicle.new(vehicle_params)

    if @vehicle.save
---
INSERT INTO "vehicles" ("vehicle_class", "subtype", "age", "number_passengers", "cylinder", "tons", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)